----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]          36,864
       BatchNorm2d-6           [-1, 64, 56, 56]             128
          Identity-7           [-1, 64, 56, 56]               0
              ReLU-8           [-1, 64, 56, 56]               0
          Identity-9           [-1, 64, 56, 56]               0
           Conv2d-10           [-1, 64, 56, 56]          36,864
      BatchNorm2d-11           [-1, 64, 56, 56]             128
             ReLU-12           [-1, 64, 56, 56]               0
       BasicBlock-13           [-1, 64, 56, 56]               0
           Conv2d-14           [-1, 64, 56, 56]          36,864
      BatchNorm2d-15           [-1, 64, 56, 56]             128
         Identity-16           [-1, 64, 56, 56]               0
             ReLU-17           [-1, 64, 56, 56]               0
         Identity-18           [-1, 64, 56, 56]               0
           Conv2d-19           [-1, 64, 56, 56]          36,864
      BatchNorm2d-20           [-1, 64, 56, 56]             128
             ReLU-21           [-1, 64, 56, 56]               0
       BasicBlock-22           [-1, 64, 56, 56]               0
           Conv2d-23          [-1, 128, 28, 28]          73,728
      BatchNorm2d-24          [-1, 128, 28, 28]             256
         Identity-25          [-1, 128, 28, 28]               0
             ReLU-26          [-1, 128, 28, 28]               0
         Identity-27          [-1, 128, 28, 28]               0
           Conv2d-28          [-1, 128, 28, 28]         147,456
      BatchNorm2d-29          [-1, 128, 28, 28]             256
           Conv2d-30          [-1, 128, 28, 28]           8,192
      BatchNorm2d-31          [-1, 128, 28, 28]             256
             ReLU-32          [-1, 128, 28, 28]               0
       BasicBlock-33          [-1, 128, 28, 28]               0
           Conv2d-34          [-1, 128, 28, 28]         147,456
      BatchNorm2d-35          [-1, 128, 28, 28]             256
         Identity-36          [-1, 128, 28, 28]               0
             ReLU-37          [-1, 128, 28, 28]               0
         Identity-38          [-1, 128, 28, 28]               0
           Conv2d-39          [-1, 128, 28, 28]         147,456
      BatchNorm2d-40          [-1, 128, 28, 28]             256
             ReLU-41          [-1, 128, 28, 28]               0
       BasicBlock-42          [-1, 128, 28, 28]               0
           Conv2d-43          [-1, 256, 14, 14]         294,912
      BatchNorm2d-44          [-1, 256, 14, 14]             512
         Identity-45          [-1, 256, 14, 14]               0
             ReLU-46          [-1, 256, 14, 14]               0
         Identity-47          [-1, 256, 14, 14]               0
           Conv2d-48          [-1, 256, 14, 14]         589,824
      BatchNorm2d-49          [-1, 256, 14, 14]             512
           Conv2d-50          [-1, 256, 14, 14]          32,768
      BatchNorm2d-51          [-1, 256, 14, 14]             512
             ReLU-52          [-1, 256, 14, 14]               0
       BasicBlock-53          [-1, 256, 14, 14]               0
           Conv2d-54          [-1, 256, 14, 14]         589,824
      BatchNorm2d-55          [-1, 256, 14, 14]             512
         Identity-56          [-1, 256, 14, 14]               0
             ReLU-57          [-1, 256, 14, 14]               0
         Identity-58          [-1, 256, 14, 14]               0
           Conv2d-59          [-1, 256, 14, 14]         589,824
      BatchNorm2d-60          [-1, 256, 14, 14]             512
             ReLU-61          [-1, 256, 14, 14]               0
       BasicBlock-62          [-1, 256, 14, 14]               0
           Conv2d-63            [-1, 512, 7, 7]       1,179,648
      BatchNorm2d-64            [-1, 512, 7, 7]           1,024
         Identity-65            [-1, 512, 7, 7]               0
             ReLU-66            [-1, 512, 7, 7]               0
         Identity-67            [-1, 512, 7, 7]               0
           Conv2d-68            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-69            [-1, 512, 7, 7]           1,024
           Conv2d-70            [-1, 512, 7, 7]         131,072
      BatchNorm2d-71            [-1, 512, 7, 7]           1,024
             ReLU-72            [-1, 512, 7, 7]               0
       BasicBlock-73            [-1, 512, 7, 7]               0
           Conv2d-74            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-75            [-1, 512, 7, 7]           1,024
         Identity-76            [-1, 512, 7, 7]               0
             ReLU-77            [-1, 512, 7, 7]               0
         Identity-78            [-1, 512, 7, 7]               0
           Conv2d-79            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-80            [-1, 512, 7, 7]           1,024
             ReLU-81            [-1, 512, 7, 7]               0
       BasicBlock-82            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-83            [-1, 512, 1, 1]               0
          Flatten-84                  [-1, 512]               0
SelectAdaptivePool2d-85                  [-1, 512]               0
           Linear-86                 [-1, 1000]         513,000
================================================================
Total params: 11,689,512
Trainable params: 11,689,512
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 74.28
Params size (MB): 44.59
Estimated Total Size (MB): 119.45
----------------------------------------------------------------
