----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 112, 112]             432
       BatchNorm2d-2         [-1, 16, 112, 112]              32
              ReLU-3         [-1, 16, 112, 112]               0
            Conv2d-4         [-1, 16, 112, 112]             144
       BatchNorm2d-5         [-1, 16, 112, 112]              32
              ReLU-6         [-1, 16, 112, 112]               0
            Conv2d-7          [-1, 8, 112, 112]             128
       BatchNorm2d-8          [-1, 8, 112, 112]              16
            Conv2d-9         [-1, 24, 112, 112]             192
      BatchNorm2d-10         [-1, 24, 112, 112]              48
             ReLU-11         [-1, 24, 112, 112]               0
           Conv2d-12           [-1, 24, 56, 56]             216
      BatchNorm2d-13           [-1, 24, 56, 56]              48
             ReLU-14           [-1, 24, 56, 56]               0
           Conv2d-15           [-1, 16, 56, 56]             384
      BatchNorm2d-16           [-1, 16, 56, 56]              32
_InvertedResidual-17           [-1, 16, 56, 56]               0
           Conv2d-18           [-1, 48, 56, 56]             768
      BatchNorm2d-19           [-1, 48, 56, 56]              96
             ReLU-20           [-1, 48, 56, 56]               0
           Conv2d-21           [-1, 48, 56, 56]             432
      BatchNorm2d-22           [-1, 48, 56, 56]              96
             ReLU-23           [-1, 48, 56, 56]               0
           Conv2d-24           [-1, 16, 56, 56]             768
      BatchNorm2d-25           [-1, 16, 56, 56]              32
_InvertedResidual-26           [-1, 16, 56, 56]               0
           Conv2d-27           [-1, 48, 56, 56]             768
      BatchNorm2d-28           [-1, 48, 56, 56]              96
             ReLU-29           [-1, 48, 56, 56]               0
           Conv2d-30           [-1, 48, 56, 56]             432
      BatchNorm2d-31           [-1, 48, 56, 56]              96
             ReLU-32           [-1, 48, 56, 56]               0
           Conv2d-33           [-1, 16, 56, 56]             768
      BatchNorm2d-34           [-1, 16, 56, 56]              32
_InvertedResidual-35           [-1, 16, 56, 56]               0
           Conv2d-36           [-1, 48, 56, 56]             768
      BatchNorm2d-37           [-1, 48, 56, 56]              96
             ReLU-38           [-1, 48, 56, 56]               0
           Conv2d-39           [-1, 48, 28, 28]           1,200
      BatchNorm2d-40           [-1, 48, 28, 28]              96
             ReLU-41           [-1, 48, 28, 28]               0
           Conv2d-42           [-1, 24, 28, 28]           1,152
      BatchNorm2d-43           [-1, 24, 28, 28]              48
_InvertedResidual-44           [-1, 24, 28, 28]               0
           Conv2d-45           [-1, 72, 28, 28]           1,728
      BatchNorm2d-46           [-1, 72, 28, 28]             144
             ReLU-47           [-1, 72, 28, 28]               0
           Conv2d-48           [-1, 72, 28, 28]           1,800
      BatchNorm2d-49           [-1, 72, 28, 28]             144
             ReLU-50           [-1, 72, 28, 28]               0
           Conv2d-51           [-1, 24, 28, 28]           1,728
      BatchNorm2d-52           [-1, 24, 28, 28]              48
_InvertedResidual-53           [-1, 24, 28, 28]               0
           Conv2d-54           [-1, 72, 28, 28]           1,728
      BatchNorm2d-55           [-1, 72, 28, 28]             144
             ReLU-56           [-1, 72, 28, 28]               0
           Conv2d-57           [-1, 72, 28, 28]           1,800
      BatchNorm2d-58           [-1, 72, 28, 28]             144
             ReLU-59           [-1, 72, 28, 28]               0
           Conv2d-60           [-1, 24, 28, 28]           1,728
      BatchNorm2d-61           [-1, 24, 28, 28]              48
_InvertedResidual-62           [-1, 24, 28, 28]               0
           Conv2d-63          [-1, 144, 28, 28]           3,456
      BatchNorm2d-64          [-1, 144, 28, 28]             288
             ReLU-65          [-1, 144, 28, 28]               0
           Conv2d-66          [-1, 144, 14, 14]           3,600
      BatchNorm2d-67          [-1, 144, 14, 14]             288
             ReLU-68          [-1, 144, 14, 14]               0
           Conv2d-69           [-1, 40, 14, 14]           5,760
      BatchNorm2d-70           [-1, 40, 14, 14]              80
_InvertedResidual-71           [-1, 40, 14, 14]               0
           Conv2d-72          [-1, 240, 14, 14]           9,600
      BatchNorm2d-73          [-1, 240, 14, 14]             480
             ReLU-74          [-1, 240, 14, 14]               0
           Conv2d-75          [-1, 240, 14, 14]           6,000
      BatchNorm2d-76          [-1, 240, 14, 14]             480
             ReLU-77          [-1, 240, 14, 14]               0
           Conv2d-78           [-1, 40, 14, 14]           9,600
      BatchNorm2d-79           [-1, 40, 14, 14]              80
_InvertedResidual-80           [-1, 40, 14, 14]               0
           Conv2d-81          [-1, 240, 14, 14]           9,600
      BatchNorm2d-82          [-1, 240, 14, 14]             480
             ReLU-83          [-1, 240, 14, 14]               0
           Conv2d-84          [-1, 240, 14, 14]           6,000
      BatchNorm2d-85          [-1, 240, 14, 14]             480
             ReLU-86          [-1, 240, 14, 14]               0
           Conv2d-87           [-1, 40, 14, 14]           9,600
      BatchNorm2d-88           [-1, 40, 14, 14]              80
_InvertedResidual-89           [-1, 40, 14, 14]               0
           Conv2d-90          [-1, 240, 14, 14]           9,600
      BatchNorm2d-91          [-1, 240, 14, 14]             480
             ReLU-92          [-1, 240, 14, 14]               0
           Conv2d-93          [-1, 240, 14, 14]           2,160
      BatchNorm2d-94          [-1, 240, 14, 14]             480
             ReLU-95          [-1, 240, 14, 14]               0
           Conv2d-96           [-1, 48, 14, 14]          11,520
      BatchNorm2d-97           [-1, 48, 14, 14]              96
_InvertedResidual-98           [-1, 48, 14, 14]               0
           Conv2d-99          [-1, 288, 14, 14]          13,824
     BatchNorm2d-100          [-1, 288, 14, 14]             576
            ReLU-101          [-1, 288, 14, 14]               0
          Conv2d-102          [-1, 288, 14, 14]           2,592
     BatchNorm2d-103          [-1, 288, 14, 14]             576
            ReLU-104          [-1, 288, 14, 14]               0
          Conv2d-105           [-1, 48, 14, 14]          13,824
     BatchNorm2d-106           [-1, 48, 14, 14]              96
_InvertedResidual-107           [-1, 48, 14, 14]               0
          Conv2d-108          [-1, 288, 14, 14]          13,824
     BatchNorm2d-109          [-1, 288, 14, 14]             576
            ReLU-110          [-1, 288, 14, 14]               0
          Conv2d-111            [-1, 288, 7, 7]           7,200
     BatchNorm2d-112            [-1, 288, 7, 7]             576
            ReLU-113            [-1, 288, 7, 7]               0
          Conv2d-114             [-1, 96, 7, 7]          27,648
     BatchNorm2d-115             [-1, 96, 7, 7]             192
_InvertedResidual-116             [-1, 96, 7, 7]               0
          Conv2d-117            [-1, 576, 7, 7]          55,296
     BatchNorm2d-118            [-1, 576, 7, 7]           1,152
            ReLU-119            [-1, 576, 7, 7]               0
          Conv2d-120            [-1, 576, 7, 7]          14,400
     BatchNorm2d-121            [-1, 576, 7, 7]           1,152
            ReLU-122            [-1, 576, 7, 7]               0
          Conv2d-123             [-1, 96, 7, 7]          55,296
     BatchNorm2d-124             [-1, 96, 7, 7]             192
_InvertedResidual-125             [-1, 96, 7, 7]               0
          Conv2d-126            [-1, 576, 7, 7]          55,296
     BatchNorm2d-127            [-1, 576, 7, 7]           1,152
            ReLU-128            [-1, 576, 7, 7]               0
          Conv2d-129            [-1, 576, 7, 7]          14,400
     BatchNorm2d-130            [-1, 576, 7, 7]           1,152
            ReLU-131            [-1, 576, 7, 7]               0
          Conv2d-132             [-1, 96, 7, 7]          55,296
     BatchNorm2d-133             [-1, 96, 7, 7]             192
_InvertedResidual-134             [-1, 96, 7, 7]               0
          Conv2d-135            [-1, 576, 7, 7]          55,296
     BatchNorm2d-136            [-1, 576, 7, 7]           1,152
            ReLU-137            [-1, 576, 7, 7]               0
          Conv2d-138            [-1, 576, 7, 7]          14,400
     BatchNorm2d-139            [-1, 576, 7, 7]           1,152
            ReLU-140            [-1, 576, 7, 7]               0
          Conv2d-141             [-1, 96, 7, 7]          55,296
     BatchNorm2d-142             [-1, 96, 7, 7]             192
_InvertedResidual-143             [-1, 96, 7, 7]               0
          Conv2d-144            [-1, 576, 7, 7]          55,296
     BatchNorm2d-145            [-1, 576, 7, 7]           1,152
            ReLU-146            [-1, 576, 7, 7]               0
          Conv2d-147            [-1, 576, 7, 7]           5,184
     BatchNorm2d-148            [-1, 576, 7, 7]           1,152
            ReLU-149            [-1, 576, 7, 7]               0
          Conv2d-150            [-1, 160, 7, 7]          92,160
     BatchNorm2d-151            [-1, 160, 7, 7]             320
_InvertedResidual-152            [-1, 160, 7, 7]               0
          Conv2d-153           [-1, 1280, 7, 7]         204,800
     BatchNorm2d-154           [-1, 1280, 7, 7]           2,560
            ReLU-155           [-1, 1280, 7, 7]               0
         Dropout-156                 [-1, 1280]               0
          Linear-157                 [-1, 1000]       1,281,000
================================================================
Total params: 2,218,512
Trainable params: 2,218,512
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 69.41
Params size (MB): 8.46
Estimated Total Size (MB): 78.45
----------------------------------------------------------------
