----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 24, 112, 112]             648
       BatchNorm2d-2         [-1, 24, 112, 112]              48
              ReLU-3         [-1, 24, 112, 112]               0
         MaxPool2d-4           [-1, 24, 56, 56]               0
            Conv2d-5           [-1, 24, 28, 28]             216
       BatchNorm2d-6           [-1, 24, 28, 28]              48
            Conv2d-7           [-1, 24, 28, 28]             576
       BatchNorm2d-8           [-1, 24, 28, 28]              48
              ReLU-9           [-1, 24, 28, 28]               0
           Conv2d-10           [-1, 24, 56, 56]             576
      BatchNorm2d-11           [-1, 24, 56, 56]              48
             ReLU-12           [-1, 24, 56, 56]               0
           Conv2d-13           [-1, 24, 28, 28]             216
      BatchNorm2d-14           [-1, 24, 28, 28]              48
           Conv2d-15           [-1, 24, 28, 28]             576
      BatchNorm2d-16           [-1, 24, 28, 28]              48
             ReLU-17           [-1, 24, 28, 28]               0
 InvertedResidual-18           [-1, 48, 28, 28]               0
           Conv2d-19           [-1, 24, 28, 28]             576
      BatchNorm2d-20           [-1, 24, 28, 28]              48
             ReLU-21           [-1, 24, 28, 28]               0
           Conv2d-22           [-1, 24, 28, 28]             216
      BatchNorm2d-23           [-1, 24, 28, 28]              48
           Conv2d-24           [-1, 24, 28, 28]             576
      BatchNorm2d-25           [-1, 24, 28, 28]              48
             ReLU-26           [-1, 24, 28, 28]               0
 InvertedResidual-27           [-1, 48, 28, 28]               0
           Conv2d-28           [-1, 24, 28, 28]             576
      BatchNorm2d-29           [-1, 24, 28, 28]              48
             ReLU-30           [-1, 24, 28, 28]               0
           Conv2d-31           [-1, 24, 28, 28]             216
      BatchNorm2d-32           [-1, 24, 28, 28]              48
           Conv2d-33           [-1, 24, 28, 28]             576
      BatchNorm2d-34           [-1, 24, 28, 28]              48
             ReLU-35           [-1, 24, 28, 28]               0
 InvertedResidual-36           [-1, 48, 28, 28]               0
           Conv2d-37           [-1, 24, 28, 28]             576
      BatchNorm2d-38           [-1, 24, 28, 28]              48
             ReLU-39           [-1, 24, 28, 28]               0
           Conv2d-40           [-1, 24, 28, 28]             216
      BatchNorm2d-41           [-1, 24, 28, 28]              48
           Conv2d-42           [-1, 24, 28, 28]             576
      BatchNorm2d-43           [-1, 24, 28, 28]              48
             ReLU-44           [-1, 24, 28, 28]               0
 InvertedResidual-45           [-1, 48, 28, 28]               0
           Conv2d-46           [-1, 48, 14, 14]             432
      BatchNorm2d-47           [-1, 48, 14, 14]              96
           Conv2d-48           [-1, 48, 14, 14]           2,304
      BatchNorm2d-49           [-1, 48, 14, 14]              96
             ReLU-50           [-1, 48, 14, 14]               0
           Conv2d-51           [-1, 48, 28, 28]           2,304
      BatchNorm2d-52           [-1, 48, 28, 28]              96
             ReLU-53           [-1, 48, 28, 28]               0
           Conv2d-54           [-1, 48, 14, 14]             432
      BatchNorm2d-55           [-1, 48, 14, 14]              96
           Conv2d-56           [-1, 48, 14, 14]           2,304
      BatchNorm2d-57           [-1, 48, 14, 14]              96
             ReLU-58           [-1, 48, 14, 14]               0
 InvertedResidual-59           [-1, 96, 14, 14]               0
           Conv2d-60           [-1, 48, 14, 14]           2,304
      BatchNorm2d-61           [-1, 48, 14, 14]              96
             ReLU-62           [-1, 48, 14, 14]               0
           Conv2d-63           [-1, 48, 14, 14]             432
      BatchNorm2d-64           [-1, 48, 14, 14]              96
           Conv2d-65           [-1, 48, 14, 14]           2,304
      BatchNorm2d-66           [-1, 48, 14, 14]              96
             ReLU-67           [-1, 48, 14, 14]               0
 InvertedResidual-68           [-1, 96, 14, 14]               0
           Conv2d-69           [-1, 48, 14, 14]           2,304
      BatchNorm2d-70           [-1, 48, 14, 14]              96
             ReLU-71           [-1, 48, 14, 14]               0
           Conv2d-72           [-1, 48, 14, 14]             432
      BatchNorm2d-73           [-1, 48, 14, 14]              96
           Conv2d-74           [-1, 48, 14, 14]           2,304
      BatchNorm2d-75           [-1, 48, 14, 14]              96
             ReLU-76           [-1, 48, 14, 14]               0
 InvertedResidual-77           [-1, 96, 14, 14]               0
           Conv2d-78           [-1, 48, 14, 14]           2,304
      BatchNorm2d-79           [-1, 48, 14, 14]              96
             ReLU-80           [-1, 48, 14, 14]               0
           Conv2d-81           [-1, 48, 14, 14]             432
      BatchNorm2d-82           [-1, 48, 14, 14]              96
           Conv2d-83           [-1, 48, 14, 14]           2,304
      BatchNorm2d-84           [-1, 48, 14, 14]              96
             ReLU-85           [-1, 48, 14, 14]               0
 InvertedResidual-86           [-1, 96, 14, 14]               0
           Conv2d-87           [-1, 48, 14, 14]           2,304
      BatchNorm2d-88           [-1, 48, 14, 14]              96
             ReLU-89           [-1, 48, 14, 14]               0
           Conv2d-90           [-1, 48, 14, 14]             432
      BatchNorm2d-91           [-1, 48, 14, 14]              96
           Conv2d-92           [-1, 48, 14, 14]           2,304
      BatchNorm2d-93           [-1, 48, 14, 14]              96
             ReLU-94           [-1, 48, 14, 14]               0
 InvertedResidual-95           [-1, 96, 14, 14]               0
           Conv2d-96           [-1, 48, 14, 14]           2,304
      BatchNorm2d-97           [-1, 48, 14, 14]              96
             ReLU-98           [-1, 48, 14, 14]               0
           Conv2d-99           [-1, 48, 14, 14]             432
     BatchNorm2d-100           [-1, 48, 14, 14]              96
          Conv2d-101           [-1, 48, 14, 14]           2,304
     BatchNorm2d-102           [-1, 48, 14, 14]              96
            ReLU-103           [-1, 48, 14, 14]               0
InvertedResidual-104           [-1, 96, 14, 14]               0
          Conv2d-105           [-1, 48, 14, 14]           2,304
     BatchNorm2d-106           [-1, 48, 14, 14]              96
            ReLU-107           [-1, 48, 14, 14]               0
          Conv2d-108           [-1, 48, 14, 14]             432
     BatchNorm2d-109           [-1, 48, 14, 14]              96
          Conv2d-110           [-1, 48, 14, 14]           2,304
     BatchNorm2d-111           [-1, 48, 14, 14]              96
            ReLU-112           [-1, 48, 14, 14]               0
InvertedResidual-113           [-1, 96, 14, 14]               0
          Conv2d-114           [-1, 48, 14, 14]           2,304
     BatchNorm2d-115           [-1, 48, 14, 14]              96
            ReLU-116           [-1, 48, 14, 14]               0
          Conv2d-117           [-1, 48, 14, 14]             432
     BatchNorm2d-118           [-1, 48, 14, 14]              96
          Conv2d-119           [-1, 48, 14, 14]           2,304
     BatchNorm2d-120           [-1, 48, 14, 14]              96
            ReLU-121           [-1, 48, 14, 14]               0
InvertedResidual-122           [-1, 96, 14, 14]               0
          Conv2d-123             [-1, 96, 7, 7]             864
     BatchNorm2d-124             [-1, 96, 7, 7]             192
          Conv2d-125             [-1, 96, 7, 7]           9,216
     BatchNorm2d-126             [-1, 96, 7, 7]             192
            ReLU-127             [-1, 96, 7, 7]               0
          Conv2d-128           [-1, 96, 14, 14]           9,216
     BatchNorm2d-129           [-1, 96, 14, 14]             192
            ReLU-130           [-1, 96, 14, 14]               0
          Conv2d-131             [-1, 96, 7, 7]             864
     BatchNorm2d-132             [-1, 96, 7, 7]             192
          Conv2d-133             [-1, 96, 7, 7]           9,216
     BatchNorm2d-134             [-1, 96, 7, 7]             192
            ReLU-135             [-1, 96, 7, 7]               0
InvertedResidual-136            [-1, 192, 7, 7]               0
          Conv2d-137             [-1, 96, 7, 7]           9,216
     BatchNorm2d-138             [-1, 96, 7, 7]             192
            ReLU-139             [-1, 96, 7, 7]               0
          Conv2d-140             [-1, 96, 7, 7]             864
     BatchNorm2d-141             [-1, 96, 7, 7]             192
          Conv2d-142             [-1, 96, 7, 7]           9,216
     BatchNorm2d-143             [-1, 96, 7, 7]             192
            ReLU-144             [-1, 96, 7, 7]               0
InvertedResidual-145            [-1, 192, 7, 7]               0
          Conv2d-146             [-1, 96, 7, 7]           9,216
     BatchNorm2d-147             [-1, 96, 7, 7]             192
            ReLU-148             [-1, 96, 7, 7]               0
          Conv2d-149             [-1, 96, 7, 7]             864
     BatchNorm2d-150             [-1, 96, 7, 7]             192
          Conv2d-151             [-1, 96, 7, 7]           9,216
     BatchNorm2d-152             [-1, 96, 7, 7]             192
            ReLU-153             [-1, 96, 7, 7]               0
InvertedResidual-154            [-1, 192, 7, 7]               0
          Conv2d-155             [-1, 96, 7, 7]           9,216
     BatchNorm2d-156             [-1, 96, 7, 7]             192
            ReLU-157             [-1, 96, 7, 7]               0
          Conv2d-158             [-1, 96, 7, 7]             864
     BatchNorm2d-159             [-1, 96, 7, 7]             192
          Conv2d-160             [-1, 96, 7, 7]           9,216
     BatchNorm2d-161             [-1, 96, 7, 7]             192
            ReLU-162             [-1, 96, 7, 7]               0
InvertedResidual-163            [-1, 192, 7, 7]               0
          Conv2d-164           [-1, 1024, 7, 7]         196,608
     BatchNorm2d-165           [-1, 1024, 7, 7]           2,048
            ReLU-166           [-1, 1024, 7, 7]               0
          Linear-167                 [-1, 1000]       1,025,000
================================================================
Total params: 1,366,792
Trainable params: 1,366,792
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 25.06
Params size (MB): 5.21
Estimated Total Size (MB): 30.85
----------------------------------------------------------------
