----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 96, 109, 109]          14,208
              ReLU-2         [-1, 96, 109, 109]               0
         MaxPool2d-3           [-1, 96, 54, 54]               0
            Conv2d-4           [-1, 16, 54, 54]           1,552
              ReLU-5           [-1, 16, 54, 54]               0
            Conv2d-6           [-1, 64, 54, 54]           1,088
              ReLU-7           [-1, 64, 54, 54]               0
            Conv2d-8           [-1, 64, 54, 54]           9,280
              ReLU-9           [-1, 64, 54, 54]               0
             Fire-10          [-1, 128, 54, 54]               0
           Conv2d-11           [-1, 16, 54, 54]           2,064
             ReLU-12           [-1, 16, 54, 54]               0
           Conv2d-13           [-1, 64, 54, 54]           1,088
             ReLU-14           [-1, 64, 54, 54]               0
           Conv2d-15           [-1, 64, 54, 54]           9,280
             ReLU-16           [-1, 64, 54, 54]               0
             Fire-17          [-1, 128, 54, 54]               0
           Conv2d-18           [-1, 32, 54, 54]           4,128
             ReLU-19           [-1, 32, 54, 54]               0
           Conv2d-20          [-1, 128, 54, 54]           4,224
             ReLU-21          [-1, 128, 54, 54]               0
           Conv2d-22          [-1, 128, 54, 54]          36,992
             ReLU-23          [-1, 128, 54, 54]               0
             Fire-24          [-1, 256, 54, 54]               0
        MaxPool2d-25          [-1, 256, 27, 27]               0
           Conv2d-26           [-1, 32, 27, 27]           8,224
             ReLU-27           [-1, 32, 27, 27]               0
           Conv2d-28          [-1, 128, 27, 27]           4,224
             ReLU-29          [-1, 128, 27, 27]               0
           Conv2d-30          [-1, 128, 27, 27]          36,992
             ReLU-31          [-1, 128, 27, 27]               0
             Fire-32          [-1, 256, 27, 27]               0
           Conv2d-33           [-1, 48, 27, 27]          12,336
             ReLU-34           [-1, 48, 27, 27]               0
           Conv2d-35          [-1, 192, 27, 27]           9,408
             ReLU-36          [-1, 192, 27, 27]               0
           Conv2d-37          [-1, 192, 27, 27]          83,136
             ReLU-38          [-1, 192, 27, 27]               0
             Fire-39          [-1, 384, 27, 27]               0
           Conv2d-40           [-1, 48, 27, 27]          18,480
             ReLU-41           [-1, 48, 27, 27]               0
           Conv2d-42          [-1, 192, 27, 27]           9,408
             ReLU-43          [-1, 192, 27, 27]               0
           Conv2d-44          [-1, 192, 27, 27]          83,136
             ReLU-45          [-1, 192, 27, 27]               0
             Fire-46          [-1, 384, 27, 27]               0
           Conv2d-47           [-1, 64, 27, 27]          24,640
             ReLU-48           [-1, 64, 27, 27]               0
           Conv2d-49          [-1, 256, 27, 27]          16,640
             ReLU-50          [-1, 256, 27, 27]               0
           Conv2d-51          [-1, 256, 27, 27]         147,712
             ReLU-52          [-1, 256, 27, 27]               0
             Fire-53          [-1, 512, 27, 27]               0
        MaxPool2d-54          [-1, 512, 13, 13]               0
           Conv2d-55           [-1, 64, 13, 13]          32,832
             ReLU-56           [-1, 64, 13, 13]               0
           Conv2d-57          [-1, 256, 13, 13]          16,640
             ReLU-58          [-1, 256, 13, 13]               0
           Conv2d-59          [-1, 256, 13, 13]         147,712
             ReLU-60          [-1, 256, 13, 13]               0
             Fire-61          [-1, 512, 13, 13]               0
          Dropout-62          [-1, 512, 13, 13]               0
           Conv2d-63         [-1, 1000, 13, 13]         513,000
             ReLU-64         [-1, 1000, 13, 13]               0
AdaptiveAvgPool2d-65           [-1, 1000, 1, 1]               0
================================================================
Total params: 1,248,424
Trainable params: 1,248,424
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 91.80
Params size (MB): 4.76
Estimated Total Size (MB): 97.14
----------------------------------------------------------------
