----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 112, 112]             864
       BatchNorm2d-2         [-1, 32, 112, 112]              64
              ReLU-3         [-1, 32, 112, 112]               0
            Conv2d-4           [-1, 48, 56, 56]           1,536
       BatchNorm2d-5           [-1, 48, 56, 56]              96
            Conv2d-6         [-1, 48, 112, 112]           1,536
       BatchNorm2d-7         [-1, 48, 112, 112]              96
              ReLU-8         [-1, 48, 112, 112]               0
            Conv2d-9           [-1, 48, 56, 56]           3,456
      BatchNorm2d-10           [-1, 48, 56, 56]              96
             ReLU-11           [-1, 48, 56, 56]               0
AdaptiveAvgPool2d-12             [-1, 48, 1, 1]               0
           Conv2d-13              [-1, 8, 1, 1]             392
             ReLU-14              [-1, 8, 1, 1]               0
           Conv2d-15             [-1, 48, 1, 1]             432
          Sigmoid-16             [-1, 48, 1, 1]               0
SqueezeExcitation-17           [-1, 48, 56, 56]               0
           Conv2d-18           [-1, 48, 56, 56]           2,304
      BatchNorm2d-19           [-1, 48, 56, 56]              96
             ReLU-20           [-1, 48, 56, 56]               0
ResBottleneckBlock-21           [-1, 48, 56, 56]               0
           Conv2d-22          [-1, 104, 28, 28]           4,992
      BatchNorm2d-23          [-1, 104, 28, 28]             208
           Conv2d-24          [-1, 104, 56, 56]           4,992
      BatchNorm2d-25          [-1, 104, 56, 56]             208
             ReLU-26          [-1, 104, 56, 56]               0
           Conv2d-27          [-1, 104, 28, 28]           7,488
      BatchNorm2d-28          [-1, 104, 28, 28]             208
             ReLU-29          [-1, 104, 28, 28]               0
AdaptiveAvgPool2d-30            [-1, 104, 1, 1]               0
           Conv2d-31             [-1, 12, 1, 1]           1,260
             ReLU-32             [-1, 12, 1, 1]               0
           Conv2d-33            [-1, 104, 1, 1]           1,352
          Sigmoid-34            [-1, 104, 1, 1]               0
SqueezeExcitation-35          [-1, 104, 28, 28]               0
           Conv2d-36          [-1, 104, 28, 28]          10,816
      BatchNorm2d-37          [-1, 104, 28, 28]             208
             ReLU-38          [-1, 104, 28, 28]               0
ResBottleneckBlock-39          [-1, 104, 28, 28]               0
           Conv2d-40          [-1, 104, 28, 28]          10,816
      BatchNorm2d-41          [-1, 104, 28, 28]             208
             ReLU-42          [-1, 104, 28, 28]               0
           Conv2d-43          [-1, 104, 28, 28]           7,488
      BatchNorm2d-44          [-1, 104, 28, 28]             208
             ReLU-45          [-1, 104, 28, 28]               0
AdaptiveAvgPool2d-46            [-1, 104, 1, 1]               0
           Conv2d-47             [-1, 26, 1, 1]           2,730
             ReLU-48             [-1, 26, 1, 1]               0
           Conv2d-49            [-1, 104, 1, 1]           2,808
          Sigmoid-50            [-1, 104, 1, 1]               0
SqueezeExcitation-51          [-1, 104, 28, 28]               0
           Conv2d-52          [-1, 104, 28, 28]          10,816
      BatchNorm2d-53          [-1, 104, 28, 28]             208
             ReLU-54          [-1, 104, 28, 28]               0
ResBottleneckBlock-55          [-1, 104, 28, 28]               0
           Conv2d-56          [-1, 104, 28, 28]          10,816
      BatchNorm2d-57          [-1, 104, 28, 28]             208
             ReLU-58          [-1, 104, 28, 28]               0
           Conv2d-59          [-1, 104, 28, 28]           7,488
      BatchNorm2d-60          [-1, 104, 28, 28]             208
             ReLU-61          [-1, 104, 28, 28]               0
AdaptiveAvgPool2d-62            [-1, 104, 1, 1]               0
           Conv2d-63             [-1, 26, 1, 1]           2,730
             ReLU-64             [-1, 26, 1, 1]               0
           Conv2d-65            [-1, 104, 1, 1]           2,808
          Sigmoid-66            [-1, 104, 1, 1]               0
SqueezeExcitation-67          [-1, 104, 28, 28]               0
           Conv2d-68          [-1, 104, 28, 28]          10,816
      BatchNorm2d-69          [-1, 104, 28, 28]             208
             ReLU-70          [-1, 104, 28, 28]               0
ResBottleneckBlock-71          [-1, 104, 28, 28]               0
           Conv2d-72          [-1, 208, 14, 14]          21,632
      BatchNorm2d-73          [-1, 208, 14, 14]             416
           Conv2d-74          [-1, 208, 28, 28]          21,632
      BatchNorm2d-75          [-1, 208, 28, 28]             416
             ReLU-76          [-1, 208, 28, 28]               0
           Conv2d-77          [-1, 208, 14, 14]          14,976
      BatchNorm2d-78          [-1, 208, 14, 14]             416
             ReLU-79          [-1, 208, 14, 14]               0
AdaptiveAvgPool2d-80            [-1, 208, 1, 1]               0
           Conv2d-81             [-1, 26, 1, 1]           5,434
             ReLU-82             [-1, 26, 1, 1]               0
           Conv2d-83            [-1, 208, 1, 1]           5,616
          Sigmoid-84            [-1, 208, 1, 1]               0
SqueezeExcitation-85          [-1, 208, 14, 14]               0
           Conv2d-86          [-1, 208, 14, 14]          43,264
      BatchNorm2d-87          [-1, 208, 14, 14]             416
             ReLU-88          [-1, 208, 14, 14]               0
ResBottleneckBlock-89          [-1, 208, 14, 14]               0
           Conv2d-90          [-1, 208, 14, 14]          43,264
      BatchNorm2d-91          [-1, 208, 14, 14]             416
             ReLU-92          [-1, 208, 14, 14]               0
           Conv2d-93          [-1, 208, 14, 14]          14,976
      BatchNorm2d-94          [-1, 208, 14, 14]             416
             ReLU-95          [-1, 208, 14, 14]               0
AdaptiveAvgPool2d-96            [-1, 208, 1, 1]               0
           Conv2d-97             [-1, 52, 1, 1]          10,868
             ReLU-98             [-1, 52, 1, 1]               0
           Conv2d-99            [-1, 208, 1, 1]          11,024
         Sigmoid-100            [-1, 208, 1, 1]               0
SqueezeExcitation-101          [-1, 208, 14, 14]               0
          Conv2d-102          [-1, 208, 14, 14]          43,264
     BatchNorm2d-103          [-1, 208, 14, 14]             416
            ReLU-104          [-1, 208, 14, 14]               0
ResBottleneckBlock-105          [-1, 208, 14, 14]               0
          Conv2d-106          [-1, 208, 14, 14]          43,264
     BatchNorm2d-107          [-1, 208, 14, 14]             416
            ReLU-108          [-1, 208, 14, 14]               0
          Conv2d-109          [-1, 208, 14, 14]          14,976
     BatchNorm2d-110          [-1, 208, 14, 14]             416
            ReLU-111          [-1, 208, 14, 14]               0
AdaptiveAvgPool2d-112            [-1, 208, 1, 1]               0
          Conv2d-113             [-1, 52, 1, 1]          10,868
            ReLU-114             [-1, 52, 1, 1]               0
          Conv2d-115            [-1, 208, 1, 1]          11,024
         Sigmoid-116            [-1, 208, 1, 1]               0
SqueezeExcitation-117          [-1, 208, 14, 14]               0
          Conv2d-118          [-1, 208, 14, 14]          43,264
     BatchNorm2d-119          [-1, 208, 14, 14]             416
            ReLU-120          [-1, 208, 14, 14]               0
ResBottleneckBlock-121          [-1, 208, 14, 14]               0
          Conv2d-122          [-1, 208, 14, 14]          43,264
     BatchNorm2d-123          [-1, 208, 14, 14]             416
            ReLU-124          [-1, 208, 14, 14]               0
          Conv2d-125          [-1, 208, 14, 14]          14,976
     BatchNorm2d-126          [-1, 208, 14, 14]             416
            ReLU-127          [-1, 208, 14, 14]               0
AdaptiveAvgPool2d-128            [-1, 208, 1, 1]               0
          Conv2d-129             [-1, 52, 1, 1]          10,868
            ReLU-130             [-1, 52, 1, 1]               0
          Conv2d-131            [-1, 208, 1, 1]          11,024
         Sigmoid-132            [-1, 208, 1, 1]               0
SqueezeExcitation-133          [-1, 208, 14, 14]               0
          Conv2d-134          [-1, 208, 14, 14]          43,264
     BatchNorm2d-135          [-1, 208, 14, 14]             416
            ReLU-136          [-1, 208, 14, 14]               0
ResBottleneckBlock-137          [-1, 208, 14, 14]               0
          Conv2d-138          [-1, 208, 14, 14]          43,264
     BatchNorm2d-139          [-1, 208, 14, 14]             416
            ReLU-140          [-1, 208, 14, 14]               0
          Conv2d-141          [-1, 208, 14, 14]          14,976
     BatchNorm2d-142          [-1, 208, 14, 14]             416
            ReLU-143          [-1, 208, 14, 14]               0
AdaptiveAvgPool2d-144            [-1, 208, 1, 1]               0
          Conv2d-145             [-1, 52, 1, 1]          10,868
            ReLU-146             [-1, 52, 1, 1]               0
          Conv2d-147            [-1, 208, 1, 1]          11,024
         Sigmoid-148            [-1, 208, 1, 1]               0
SqueezeExcitation-149          [-1, 208, 14, 14]               0
          Conv2d-150          [-1, 208, 14, 14]          43,264
     BatchNorm2d-151          [-1, 208, 14, 14]             416
            ReLU-152          [-1, 208, 14, 14]               0
ResBottleneckBlock-153          [-1, 208, 14, 14]               0
          Conv2d-154          [-1, 208, 14, 14]          43,264
     BatchNorm2d-155          [-1, 208, 14, 14]             416
            ReLU-156          [-1, 208, 14, 14]               0
          Conv2d-157          [-1, 208, 14, 14]          14,976
     BatchNorm2d-158          [-1, 208, 14, 14]             416
            ReLU-159          [-1, 208, 14, 14]               0
AdaptiveAvgPool2d-160            [-1, 208, 1, 1]               0
          Conv2d-161             [-1, 52, 1, 1]          10,868
            ReLU-162             [-1, 52, 1, 1]               0
          Conv2d-163            [-1, 208, 1, 1]          11,024
         Sigmoid-164            [-1, 208, 1, 1]               0
SqueezeExcitation-165          [-1, 208, 14, 14]               0
          Conv2d-166          [-1, 208, 14, 14]          43,264
     BatchNorm2d-167          [-1, 208, 14, 14]             416
            ReLU-168          [-1, 208, 14, 14]               0
ResBottleneckBlock-169          [-1, 208, 14, 14]               0
          Conv2d-170            [-1, 440, 7, 7]          91,520
     BatchNorm2d-171            [-1, 440, 7, 7]             880
          Conv2d-172          [-1, 440, 14, 14]          91,520
     BatchNorm2d-173          [-1, 440, 14, 14]             880
            ReLU-174          [-1, 440, 14, 14]               0
          Conv2d-175            [-1, 440, 7, 7]          31,680
     BatchNorm2d-176            [-1, 440, 7, 7]             880
            ReLU-177            [-1, 440, 7, 7]               0
AdaptiveAvgPool2d-178            [-1, 440, 1, 1]               0
          Conv2d-179             [-1, 52, 1, 1]          22,932
            ReLU-180             [-1, 52, 1, 1]               0
          Conv2d-181            [-1, 440, 1, 1]          23,320
         Sigmoid-182            [-1, 440, 1, 1]               0
SqueezeExcitation-183            [-1, 440, 7, 7]               0
          Conv2d-184            [-1, 440, 7, 7]         193,600
     BatchNorm2d-185            [-1, 440, 7, 7]             880
            ReLU-186            [-1, 440, 7, 7]               0
ResBottleneckBlock-187            [-1, 440, 7, 7]               0
          Conv2d-188            [-1, 440, 7, 7]         193,600
     BatchNorm2d-189            [-1, 440, 7, 7]             880
            ReLU-190            [-1, 440, 7, 7]               0
          Conv2d-191            [-1, 440, 7, 7]          31,680
     BatchNorm2d-192            [-1, 440, 7, 7]             880
            ReLU-193            [-1, 440, 7, 7]               0
AdaptiveAvgPool2d-194            [-1, 440, 1, 1]               0
          Conv2d-195            [-1, 110, 1, 1]          48,510
            ReLU-196            [-1, 110, 1, 1]               0
          Conv2d-197            [-1, 440, 1, 1]          48,840
         Sigmoid-198            [-1, 440, 1, 1]               0
SqueezeExcitation-199            [-1, 440, 7, 7]               0
          Conv2d-200            [-1, 440, 7, 7]         193,600
     BatchNorm2d-201            [-1, 440, 7, 7]             880
            ReLU-202            [-1, 440, 7, 7]               0
ResBottleneckBlock-203            [-1, 440, 7, 7]               0
          Conv2d-204            [-1, 440, 7, 7]         193,600
     BatchNorm2d-205            [-1, 440, 7, 7]             880
            ReLU-206            [-1, 440, 7, 7]               0
          Conv2d-207            [-1, 440, 7, 7]          31,680
     BatchNorm2d-208            [-1, 440, 7, 7]             880
            ReLU-209            [-1, 440, 7, 7]               0
AdaptiveAvgPool2d-210            [-1, 440, 1, 1]               0
          Conv2d-211            [-1, 110, 1, 1]          48,510
            ReLU-212            [-1, 110, 1, 1]               0
          Conv2d-213            [-1, 440, 1, 1]          48,840
         Sigmoid-214            [-1, 440, 1, 1]               0
SqueezeExcitation-215            [-1, 440, 7, 7]               0
          Conv2d-216            [-1, 440, 7, 7]         193,600
     BatchNorm2d-217            [-1, 440, 7, 7]             880
            ReLU-218            [-1, 440, 7, 7]               0
ResBottleneckBlock-219            [-1, 440, 7, 7]               0
          Conv2d-220            [-1, 440, 7, 7]         193,600
     BatchNorm2d-221            [-1, 440, 7, 7]             880
            ReLU-222            [-1, 440, 7, 7]               0
          Conv2d-223            [-1, 440, 7, 7]          31,680
     BatchNorm2d-224            [-1, 440, 7, 7]             880
            ReLU-225            [-1, 440, 7, 7]               0
AdaptiveAvgPool2d-226            [-1, 440, 1, 1]               0
          Conv2d-227            [-1, 110, 1, 1]          48,510
            ReLU-228            [-1, 110, 1, 1]               0
          Conv2d-229            [-1, 440, 1, 1]          48,840
         Sigmoid-230            [-1, 440, 1, 1]               0
SqueezeExcitation-231            [-1, 440, 7, 7]               0
          Conv2d-232            [-1, 440, 7, 7]         193,600
     BatchNorm2d-233            [-1, 440, 7, 7]             880
            ReLU-234            [-1, 440, 7, 7]               0
ResBottleneckBlock-235            [-1, 440, 7, 7]               0
          Conv2d-236            [-1, 440, 7, 7]         193,600
     BatchNorm2d-237            [-1, 440, 7, 7]             880
            ReLU-238            [-1, 440, 7, 7]               0
          Conv2d-239            [-1, 440, 7, 7]          31,680
     BatchNorm2d-240            [-1, 440, 7, 7]             880
            ReLU-241            [-1, 440, 7, 7]               0
AdaptiveAvgPool2d-242            [-1, 440, 1, 1]               0
          Conv2d-243            [-1, 110, 1, 1]          48,510
            ReLU-244            [-1, 110, 1, 1]               0
          Conv2d-245            [-1, 440, 1, 1]          48,840
         Sigmoid-246            [-1, 440, 1, 1]               0
SqueezeExcitation-247            [-1, 440, 7, 7]               0
          Conv2d-248            [-1, 440, 7, 7]         193,600
     BatchNorm2d-249            [-1, 440, 7, 7]             880
            ReLU-250            [-1, 440, 7, 7]               0
ResBottleneckBlock-251            [-1, 440, 7, 7]               0
          Conv2d-252            [-1, 440, 7, 7]         193,600
     BatchNorm2d-253            [-1, 440, 7, 7]             880
            ReLU-254            [-1, 440, 7, 7]               0
          Conv2d-255            [-1, 440, 7, 7]          31,680
     BatchNorm2d-256            [-1, 440, 7, 7]             880
            ReLU-257            [-1, 440, 7, 7]               0
AdaptiveAvgPool2d-258            [-1, 440, 1, 1]               0
          Conv2d-259            [-1, 110, 1, 1]          48,510
            ReLU-260            [-1, 110, 1, 1]               0
          Conv2d-261            [-1, 440, 1, 1]          48,840
         Sigmoid-262            [-1, 440, 1, 1]               0
SqueezeExcitation-263            [-1, 440, 7, 7]               0
          Conv2d-264            [-1, 440, 7, 7]         193,600
     BatchNorm2d-265            [-1, 440, 7, 7]             880
            ReLU-266            [-1, 440, 7, 7]               0
ResBottleneckBlock-267            [-1, 440, 7, 7]               0
AdaptiveAvgPool2d-268            [-1, 440, 1, 1]               0
          Linear-269                 [-1, 1000]         441,000
================================================================
Total params: 4,344,144
Trainable params: 4,344,144
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 98.56
Params size (MB): 16.57
Estimated Total Size (MB): 115.71
----------------------------------------------------------------
