----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 768, 14, 14]         590,592
          Identity-2             [-1, 196, 768]               0
        PatchEmbed-3             [-1, 196, 768]               0
           Dropout-4             [-1, 197, 768]               0
          Identity-5             [-1, 197, 768]               0
          Identity-6             [-1, 197, 768]               0
         LayerNorm-7             [-1, 197, 768]           1,536
            Linear-8            [-1, 197, 2304]       1,771,776
          Identity-9          [-1, 12, 197, 64]               0
         Identity-10          [-1, 12, 197, 64]               0
          Dropout-11         [-1, 12, 197, 197]               0
           Linear-12             [-1, 197, 768]         590,592
          Dropout-13             [-1, 197, 768]               0
        Attention-14             [-1, 197, 768]               0
         Identity-15             [-1, 197, 768]               0
         Identity-16             [-1, 197, 768]               0
        LayerNorm-17             [-1, 197, 768]           1,536
           Linear-18            [-1, 197, 3072]       2,362,368
             GELU-19            [-1, 197, 3072]               0
          Dropout-20            [-1, 197, 3072]               0
           Linear-21             [-1, 197, 768]       2,360,064
          Dropout-22             [-1, 197, 768]               0
              Mlp-23             [-1, 197, 768]               0
         Identity-24             [-1, 197, 768]               0
         Identity-25             [-1, 197, 768]               0
            Block-26             [-1, 197, 768]               0
        LayerNorm-27             [-1, 197, 768]           1,536
           Linear-28            [-1, 197, 2304]       1,771,776
         Identity-29          [-1, 12, 197, 64]               0
         Identity-30          [-1, 12, 197, 64]               0
          Dropout-31         [-1, 12, 197, 197]               0
           Linear-32             [-1, 197, 768]         590,592
          Dropout-33             [-1, 197, 768]               0
        Attention-34             [-1, 197, 768]               0
         Identity-35             [-1, 197, 768]               0
         Identity-36             [-1, 197, 768]               0
        LayerNorm-37             [-1, 197, 768]           1,536
           Linear-38            [-1, 197, 3072]       2,362,368
             GELU-39            [-1, 197, 3072]               0
          Dropout-40            [-1, 197, 3072]               0
           Linear-41             [-1, 197, 768]       2,360,064
          Dropout-42             [-1, 197, 768]               0
              Mlp-43             [-1, 197, 768]               0
         Identity-44             [-1, 197, 768]               0
         Identity-45             [-1, 197, 768]               0
            Block-46             [-1, 197, 768]               0
        LayerNorm-47             [-1, 197, 768]           1,536
           Linear-48            [-1, 197, 2304]       1,771,776
         Identity-49          [-1, 12, 197, 64]               0
         Identity-50          [-1, 12, 197, 64]               0
          Dropout-51         [-1, 12, 197, 197]               0
           Linear-52             [-1, 197, 768]         590,592
          Dropout-53             [-1, 197, 768]               0
        Attention-54             [-1, 197, 768]               0
         Identity-55             [-1, 197, 768]               0
         Identity-56             [-1, 197, 768]               0
        LayerNorm-57             [-1, 197, 768]           1,536
           Linear-58            [-1, 197, 3072]       2,362,368
             GELU-59            [-1, 197, 3072]               0
          Dropout-60            [-1, 197, 3072]               0
           Linear-61             [-1, 197, 768]       2,360,064
          Dropout-62             [-1, 197, 768]               0
              Mlp-63             [-1, 197, 768]               0
         Identity-64             [-1, 197, 768]               0
         Identity-65             [-1, 197, 768]               0
            Block-66             [-1, 197, 768]               0
        LayerNorm-67             [-1, 197, 768]           1,536
           Linear-68            [-1, 197, 2304]       1,771,776
         Identity-69          [-1, 12, 197, 64]               0
         Identity-70          [-1, 12, 197, 64]               0
          Dropout-71         [-1, 12, 197, 197]               0
           Linear-72             [-1, 197, 768]         590,592
          Dropout-73             [-1, 197, 768]               0
        Attention-74             [-1, 197, 768]               0
         Identity-75             [-1, 197, 768]               0
         Identity-76             [-1, 197, 768]               0
        LayerNorm-77             [-1, 197, 768]           1,536
           Linear-78            [-1, 197, 3072]       2,362,368
             GELU-79            [-1, 197, 3072]               0
          Dropout-80            [-1, 197, 3072]               0
           Linear-81             [-1, 197, 768]       2,360,064
          Dropout-82             [-1, 197, 768]               0
              Mlp-83             [-1, 197, 768]               0
         Identity-84             [-1, 197, 768]               0
         Identity-85             [-1, 197, 768]               0
            Block-86             [-1, 197, 768]               0
        LayerNorm-87             [-1, 197, 768]           1,536
           Linear-88            [-1, 197, 2304]       1,771,776
         Identity-89          [-1, 12, 197, 64]               0
         Identity-90          [-1, 12, 197, 64]               0
          Dropout-91         [-1, 12, 197, 197]               0
           Linear-92             [-1, 197, 768]         590,592
          Dropout-93             [-1, 197, 768]               0
        Attention-94             [-1, 197, 768]               0
         Identity-95             [-1, 197, 768]               0
         Identity-96             [-1, 197, 768]               0
        LayerNorm-97             [-1, 197, 768]           1,536
           Linear-98            [-1, 197, 3072]       2,362,368
             GELU-99            [-1, 197, 3072]               0
         Dropout-100            [-1, 197, 3072]               0
          Linear-101             [-1, 197, 768]       2,360,064
         Dropout-102             [-1, 197, 768]               0
             Mlp-103             [-1, 197, 768]               0
        Identity-104             [-1, 197, 768]               0
        Identity-105             [-1, 197, 768]               0
           Block-106             [-1, 197, 768]               0
       LayerNorm-107             [-1, 197, 768]           1,536
          Linear-108            [-1, 197, 2304]       1,771,776
        Identity-109          [-1, 12, 197, 64]               0
        Identity-110          [-1, 12, 197, 64]               0
         Dropout-111         [-1, 12, 197, 197]               0
          Linear-112             [-1, 197, 768]         590,592
         Dropout-113             [-1, 197, 768]               0
       Attention-114             [-1, 197, 768]               0
        Identity-115             [-1, 197, 768]               0
        Identity-116             [-1, 197, 768]               0
       LayerNorm-117             [-1, 197, 768]           1,536
          Linear-118            [-1, 197, 3072]       2,362,368
            GELU-119            [-1, 197, 3072]               0
         Dropout-120            [-1, 197, 3072]               0
          Linear-121             [-1, 197, 768]       2,360,064
         Dropout-122             [-1, 197, 768]               0
             Mlp-123             [-1, 197, 768]               0
        Identity-124             [-1, 197, 768]               0
        Identity-125             [-1, 197, 768]               0
           Block-126             [-1, 197, 768]               0
       LayerNorm-127             [-1, 197, 768]           1,536
          Linear-128            [-1, 197, 2304]       1,771,776
        Identity-129          [-1, 12, 197, 64]               0
        Identity-130          [-1, 12, 197, 64]               0
         Dropout-131         [-1, 12, 197, 197]               0
          Linear-132             [-1, 197, 768]         590,592
         Dropout-133             [-1, 197, 768]               0
       Attention-134             [-1, 197, 768]               0
        Identity-135             [-1, 197, 768]               0
        Identity-136             [-1, 197, 768]               0
       LayerNorm-137             [-1, 197, 768]           1,536
          Linear-138            [-1, 197, 3072]       2,362,368
            GELU-139            [-1, 197, 3072]               0
         Dropout-140            [-1, 197, 3072]               0
          Linear-141             [-1, 197, 768]       2,360,064
         Dropout-142             [-1, 197, 768]               0
             Mlp-143             [-1, 197, 768]               0
        Identity-144             [-1, 197, 768]               0
        Identity-145             [-1, 197, 768]               0
           Block-146             [-1, 197, 768]               0
       LayerNorm-147             [-1, 197, 768]           1,536
          Linear-148            [-1, 197, 2304]       1,771,776
        Identity-149          [-1, 12, 197, 64]               0
        Identity-150          [-1, 12, 197, 64]               0
         Dropout-151         [-1, 12, 197, 197]               0
          Linear-152             [-1, 197, 768]         590,592
         Dropout-153             [-1, 197, 768]               0
       Attention-154             [-1, 197, 768]               0
        Identity-155             [-1, 197, 768]               0
        Identity-156             [-1, 197, 768]               0
       LayerNorm-157             [-1, 197, 768]           1,536
          Linear-158            [-1, 197, 3072]       2,362,368
            GELU-159            [-1, 197, 3072]               0
         Dropout-160            [-1, 197, 3072]               0
          Linear-161             [-1, 197, 768]       2,360,064
         Dropout-162             [-1, 197, 768]               0
             Mlp-163             [-1, 197, 768]               0
        Identity-164             [-1, 197, 768]               0
        Identity-165             [-1, 197, 768]               0
           Block-166             [-1, 197, 768]               0
       LayerNorm-167             [-1, 197, 768]           1,536
          Linear-168            [-1, 197, 2304]       1,771,776
        Identity-169          [-1, 12, 197, 64]               0
        Identity-170          [-1, 12, 197, 64]               0
         Dropout-171         [-1, 12, 197, 197]               0
          Linear-172             [-1, 197, 768]         590,592
         Dropout-173             [-1, 197, 768]               0
       Attention-174             [-1, 197, 768]               0
        Identity-175             [-1, 197, 768]               0
        Identity-176             [-1, 197, 768]               0
       LayerNorm-177             [-1, 197, 768]           1,536
          Linear-178            [-1, 197, 3072]       2,362,368
            GELU-179            [-1, 197, 3072]               0
         Dropout-180            [-1, 197, 3072]               0
          Linear-181             [-1, 197, 768]       2,360,064
         Dropout-182             [-1, 197, 768]               0
             Mlp-183             [-1, 197, 768]               0
        Identity-184             [-1, 197, 768]               0
        Identity-185             [-1, 197, 768]               0
           Block-186             [-1, 197, 768]               0
       LayerNorm-187             [-1, 197, 768]           1,536
          Linear-188            [-1, 197, 2304]       1,771,776
        Identity-189          [-1, 12, 197, 64]               0
        Identity-190          [-1, 12, 197, 64]               0
         Dropout-191         [-1, 12, 197, 197]               0
          Linear-192             [-1, 197, 768]         590,592
         Dropout-193             [-1, 197, 768]               0
       Attention-194             [-1, 197, 768]               0
        Identity-195             [-1, 197, 768]               0
        Identity-196             [-1, 197, 768]               0
       LayerNorm-197             [-1, 197, 768]           1,536
          Linear-198            [-1, 197, 3072]       2,362,368
            GELU-199            [-1, 197, 3072]               0
         Dropout-200            [-1, 197, 3072]               0
          Linear-201             [-1, 197, 768]       2,360,064
         Dropout-202             [-1, 197, 768]               0
             Mlp-203             [-1, 197, 768]               0
        Identity-204             [-1, 197, 768]               0
        Identity-205             [-1, 197, 768]               0
           Block-206             [-1, 197, 768]               0
       LayerNorm-207             [-1, 197, 768]           1,536
          Linear-208            [-1, 197, 2304]       1,771,776
        Identity-209          [-1, 12, 197, 64]               0
        Identity-210          [-1, 12, 197, 64]               0
         Dropout-211         [-1, 12, 197, 197]               0
          Linear-212             [-1, 197, 768]         590,592
         Dropout-213             [-1, 197, 768]               0
       Attention-214             [-1, 197, 768]               0
        Identity-215             [-1, 197, 768]               0
        Identity-216             [-1, 197, 768]               0
       LayerNorm-217             [-1, 197, 768]           1,536
          Linear-218            [-1, 197, 3072]       2,362,368
            GELU-219            [-1, 197, 3072]               0
         Dropout-220            [-1, 197, 3072]               0
          Linear-221             [-1, 197, 768]       2,360,064
         Dropout-222             [-1, 197, 768]               0
             Mlp-223             [-1, 197, 768]               0
        Identity-224             [-1, 197, 768]               0
        Identity-225             [-1, 197, 768]               0
           Block-226             [-1, 197, 768]               0
       LayerNorm-227             [-1, 197, 768]           1,536
          Linear-228            [-1, 197, 2304]       1,771,776
        Identity-229          [-1, 12, 197, 64]               0
        Identity-230          [-1, 12, 197, 64]               0
         Dropout-231         [-1, 12, 197, 197]               0
          Linear-232             [-1, 197, 768]         590,592
         Dropout-233             [-1, 197, 768]               0
       Attention-234             [-1, 197, 768]               0
        Identity-235             [-1, 197, 768]               0
        Identity-236             [-1, 197, 768]               0
       LayerNorm-237             [-1, 197, 768]           1,536
          Linear-238            [-1, 197, 3072]       2,362,368
            GELU-239            [-1, 197, 3072]               0
         Dropout-240            [-1, 197, 3072]               0
          Linear-241             [-1, 197, 768]       2,360,064
         Dropout-242             [-1, 197, 768]               0
             Mlp-243             [-1, 197, 768]               0
        Identity-244             [-1, 197, 768]               0
        Identity-245             [-1, 197, 768]               0
           Block-246             [-1, 197, 768]               0
       LayerNorm-247             [-1, 197, 768]           1,536
        Identity-248                  [-1, 768]               0
         Dropout-249                  [-1, 768]               0
          Linear-250                 [-1, 1000]         769,000
================================================================
Total params: 86,415,592
Trainable params: 86,415,592
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 466.27
Params size (MB): 329.65
Estimated Total Size (MB): 796.49
----------------------------------------------------------------
