----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 96, 56, 56]           4,704
           Permute-2           [-1, 56, 56, 96]               0
         LayerNorm-3           [-1, 56, 56, 96]             192
         LayerNorm-4           [-1, 56, 56, 96]             192
ShiftedWindowAttention-5           [-1, 56, 56, 96]               0
   StochasticDepth-6           [-1, 56, 56, 96]               0
         LayerNorm-7           [-1, 56, 56, 96]             192
            Linear-8          [-1, 56, 56, 384]          37,248
              GELU-9          [-1, 56, 56, 384]               0
          Dropout-10          [-1, 56, 56, 384]               0
           Linear-11           [-1, 56, 56, 96]          36,960
          Dropout-12           [-1, 56, 56, 96]               0
  StochasticDepth-13           [-1, 56, 56, 96]               0
SwinTransformerBlock-14           [-1, 56, 56, 96]               0
        LayerNorm-15           [-1, 56, 56, 96]             192
ShiftedWindowAttention-16           [-1, 56, 56, 96]               0
  StochasticDepth-17           [-1, 56, 56, 96]               0
        LayerNorm-18           [-1, 56, 56, 96]             192
           Linear-19          [-1, 56, 56, 384]          37,248
             GELU-20          [-1, 56, 56, 384]               0
          Dropout-21          [-1, 56, 56, 384]               0
           Linear-22           [-1, 56, 56, 96]          36,960
          Dropout-23           [-1, 56, 56, 96]               0
  StochasticDepth-24           [-1, 56, 56, 96]               0
SwinTransformerBlock-25           [-1, 56, 56, 96]               0
        LayerNorm-26          [-1, 28, 28, 384]             768
           Linear-27          [-1, 28, 28, 192]          73,728
     PatchMerging-28          [-1, 28, 28, 192]               0
        LayerNorm-29          [-1, 28, 28, 192]             384
ShiftedWindowAttention-30          [-1, 28, 28, 192]               0
  StochasticDepth-31          [-1, 28, 28, 192]               0
        LayerNorm-32          [-1, 28, 28, 192]             384
           Linear-33          [-1, 28, 28, 768]         148,224
             GELU-34          [-1, 28, 28, 768]               0
          Dropout-35          [-1, 28, 28, 768]               0
           Linear-36          [-1, 28, 28, 192]         147,648
          Dropout-37          [-1, 28, 28, 192]               0
  StochasticDepth-38          [-1, 28, 28, 192]               0
SwinTransformerBlock-39          [-1, 28, 28, 192]               0
        LayerNorm-40          [-1, 28, 28, 192]             384
ShiftedWindowAttention-41          [-1, 28, 28, 192]               0
  StochasticDepth-42          [-1, 28, 28, 192]               0
        LayerNorm-43          [-1, 28, 28, 192]             384
           Linear-44          [-1, 28, 28, 768]         148,224
             GELU-45          [-1, 28, 28, 768]               0
          Dropout-46          [-1, 28, 28, 768]               0
           Linear-47          [-1, 28, 28, 192]         147,648
          Dropout-48          [-1, 28, 28, 192]               0
  StochasticDepth-49          [-1, 28, 28, 192]               0
SwinTransformerBlock-50          [-1, 28, 28, 192]               0
        LayerNorm-51          [-1, 14, 14, 768]           1,536
           Linear-52          [-1, 14, 14, 384]         294,912
     PatchMerging-53          [-1, 14, 14, 384]               0
        LayerNorm-54          [-1, 14, 14, 384]             768
ShiftedWindowAttention-55          [-1, 14, 14, 384]               0
  StochasticDepth-56          [-1, 14, 14, 384]               0
        LayerNorm-57          [-1, 14, 14, 384]             768
           Linear-58         [-1, 14, 14, 1536]         591,360
             GELU-59         [-1, 14, 14, 1536]               0
          Dropout-60         [-1, 14, 14, 1536]               0
           Linear-61          [-1, 14, 14, 384]         590,208
          Dropout-62          [-1, 14, 14, 384]               0
  StochasticDepth-63          [-1, 14, 14, 384]               0
SwinTransformerBlock-64          [-1, 14, 14, 384]               0
        LayerNorm-65          [-1, 14, 14, 384]             768
ShiftedWindowAttention-66          [-1, 14, 14, 384]               0
  StochasticDepth-67          [-1, 14, 14, 384]               0
        LayerNorm-68          [-1, 14, 14, 384]             768
           Linear-69         [-1, 14, 14, 1536]         591,360
             GELU-70         [-1, 14, 14, 1536]               0
          Dropout-71         [-1, 14, 14, 1536]               0
           Linear-72          [-1, 14, 14, 384]         590,208
          Dropout-73          [-1, 14, 14, 384]               0
  StochasticDepth-74          [-1, 14, 14, 384]               0
SwinTransformerBlock-75          [-1, 14, 14, 384]               0
        LayerNorm-76          [-1, 14, 14, 384]             768
ShiftedWindowAttention-77          [-1, 14, 14, 384]               0
  StochasticDepth-78          [-1, 14, 14, 384]               0
        LayerNorm-79          [-1, 14, 14, 384]             768
           Linear-80         [-1, 14, 14, 1536]         591,360
             GELU-81         [-1, 14, 14, 1536]               0
          Dropout-82         [-1, 14, 14, 1536]               0
           Linear-83          [-1, 14, 14, 384]         590,208
          Dropout-84          [-1, 14, 14, 384]               0
  StochasticDepth-85          [-1, 14, 14, 384]               0
SwinTransformerBlock-86          [-1, 14, 14, 384]               0
        LayerNorm-87          [-1, 14, 14, 384]             768
ShiftedWindowAttention-88          [-1, 14, 14, 384]               0
  StochasticDepth-89          [-1, 14, 14, 384]               0
        LayerNorm-90          [-1, 14, 14, 384]             768
           Linear-91         [-1, 14, 14, 1536]         591,360
             GELU-92         [-1, 14, 14, 1536]               0
          Dropout-93         [-1, 14, 14, 1536]               0
           Linear-94          [-1, 14, 14, 384]         590,208
          Dropout-95          [-1, 14, 14, 384]               0
  StochasticDepth-96          [-1, 14, 14, 384]               0
SwinTransformerBlock-97          [-1, 14, 14, 384]               0
        LayerNorm-98          [-1, 14, 14, 384]             768
ShiftedWindowAttention-99          [-1, 14, 14, 384]               0
 StochasticDepth-100          [-1, 14, 14, 384]               0
       LayerNorm-101          [-1, 14, 14, 384]             768
          Linear-102         [-1, 14, 14, 1536]         591,360
            GELU-103         [-1, 14, 14, 1536]               0
         Dropout-104         [-1, 14, 14, 1536]               0
          Linear-105          [-1, 14, 14, 384]         590,208
         Dropout-106          [-1, 14, 14, 384]               0
 StochasticDepth-107          [-1, 14, 14, 384]               0
SwinTransformerBlock-108          [-1, 14, 14, 384]               0
       LayerNorm-109          [-1, 14, 14, 384]             768
ShiftedWindowAttention-110          [-1, 14, 14, 384]               0
 StochasticDepth-111          [-1, 14, 14, 384]               0
       LayerNorm-112          [-1, 14, 14, 384]             768
          Linear-113         [-1, 14, 14, 1536]         591,360
            GELU-114         [-1, 14, 14, 1536]               0
         Dropout-115         [-1, 14, 14, 1536]               0
          Linear-116          [-1, 14, 14, 384]         590,208
         Dropout-117          [-1, 14, 14, 384]               0
 StochasticDepth-118          [-1, 14, 14, 384]               0
SwinTransformerBlock-119          [-1, 14, 14, 384]               0
       LayerNorm-120           [-1, 7, 7, 1536]           3,072
          Linear-121            [-1, 7, 7, 768]       1,179,648
    PatchMerging-122            [-1, 7, 7, 768]               0
       LayerNorm-123            [-1, 7, 7, 768]           1,536
ShiftedWindowAttention-124            [-1, 7, 7, 768]               0
 StochasticDepth-125            [-1, 7, 7, 768]               0
       LayerNorm-126            [-1, 7, 7, 768]           1,536
          Linear-127           [-1, 7, 7, 3072]       2,362,368
            GELU-128           [-1, 7, 7, 3072]               0
         Dropout-129           [-1, 7, 7, 3072]               0
          Linear-130            [-1, 7, 7, 768]       2,360,064
         Dropout-131            [-1, 7, 7, 768]               0
 StochasticDepth-132            [-1, 7, 7, 768]               0
SwinTransformerBlock-133            [-1, 7, 7, 768]               0
       LayerNorm-134            [-1, 7, 7, 768]           1,536
ShiftedWindowAttention-135            [-1, 7, 7, 768]               0
 StochasticDepth-136            [-1, 7, 7, 768]               0
       LayerNorm-137            [-1, 7, 7, 768]           1,536
          Linear-138           [-1, 7, 7, 3072]       2,362,368
            GELU-139           [-1, 7, 7, 3072]               0
         Dropout-140           [-1, 7, 7, 3072]               0
          Linear-141            [-1, 7, 7, 768]       2,360,064
         Dropout-142            [-1, 7, 7, 768]               0
 StochasticDepth-143            [-1, 7, 7, 768]               0
SwinTransformerBlock-144            [-1, 7, 7, 768]               0
       LayerNorm-145            [-1, 7, 7, 768]           1,536
         Permute-146            [-1, 768, 7, 7]               0
AdaptiveAvgPool2d-147            [-1, 768, 1, 1]               0
         Flatten-148                  [-1, 768]               0
          Linear-149                 [-1, 1000]         769,000
================================================================
Total params: 19,621,192
Trainable params: 19,621,192
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 233.73
Params size (MB): 74.85
Estimated Total Size (MB): 309.15
----------------------------------------------------------------
