====================================================================================================
Layer (type:depth-idx)                             Output Shape              Param #
====================================================================================================
GPT2ForSequenceClassification                      [1, 12, 128, 64]          --
├─GPT2Model: 1-1                                   [1, 12, 128, 64]          --
│    └─Embedding: 2-1                              [1, 128, 768]             38,597,376
│    └─Embedding: 2-2                              [1, 128, 768]             786,432
│    └─Dropout: 2-3                                [1, 128, 768]             --
│    └─ModuleList: 2-4                             --                        --
│    │    └─GPT2Block: 3-1                         [1, 128, 768]             7,087,872
│    │    └─GPT2Block: 3-2                         [1, 128, 768]             7,087,872
│    │    └─GPT2Block: 3-3                         [1, 128, 768]             7,087,872
│    │    └─GPT2Block: 3-4                         [1, 128, 768]             7,087,872
│    │    └─GPT2Block: 3-5                         [1, 128, 768]             7,087,872
│    │    └─GPT2Block: 3-6                         [1, 128, 768]             7,087,872
│    │    └─GPT2Block: 3-7                         [1, 128, 768]             7,087,872
│    │    └─GPT2Block: 3-8                         [1, 128, 768]             7,087,872
│    │    └─GPT2Block: 3-9                         [1, 128, 768]             7,087,872
│    │    └─GPT2Block: 3-10                        [1, 128, 768]             7,087,872
│    │    └─GPT2Block: 3-11                        [1, 128, 768]             7,087,872
│    │    └─GPT2Block: 3-12                        [1, 128, 768]             7,087,872
│    └─LayerNorm: 2-5                              [1, 128, 768]             1,536
├─Linear: 1-2                                      [1, 128, 2]               1,536
====================================================================================================
Total params: 124,441,344
Trainable params: 124,441,344
Non-trainable params: 0
Total mult-adds (G): 163.31
====================================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 106.17
Params size (MB): 497.77
Estimated Total Size (MB): 603.94
====================================================================================================
