----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 128, 56, 56]           6,272
         LayerNorm-2          [-1, 56, 56, 128]             256
        PatchEmbed-3          [-1, 56, 56, 128]               0
          Identity-4          [-1, 56, 56, 128]               0
         LayerNorm-5          [-1, 56, 56, 128]             256
            Linear-6              [-1, 49, 384]          49,536
           Softmax-7            [-1, 4, 49, 49]               0
           Dropout-8            [-1, 4, 49, 49]               0
            Linear-9              [-1, 49, 128]          16,512
          Dropout-10              [-1, 49, 128]               0
  WindowAttention-11              [-1, 49, 128]               0
         Identity-12          [-1, 56, 56, 128]               0
        LayerNorm-13            [-1, 3136, 128]             256
           Linear-14            [-1, 3136, 512]          66,048
             GELU-15            [-1, 3136, 512]               0
          Dropout-16            [-1, 3136, 512]               0
           Linear-17            [-1, 3136, 128]          65,664
          Dropout-18            [-1, 3136, 128]               0
              Mlp-19            [-1, 3136, 128]               0
         Identity-20            [-1, 3136, 128]               0
SwinTransformerBlock-21          [-1, 56, 56, 128]               0
        LayerNorm-22          [-1, 56, 56, 128]             256
           Linear-23              [-1, 49, 384]          49,536
          Softmax-24            [-1, 4, 49, 49]               0
          Dropout-25            [-1, 4, 49, 49]               0
           Linear-26              [-1, 49, 128]          16,512
          Dropout-27              [-1, 49, 128]               0
  WindowAttention-28              [-1, 49, 128]               0
         DropPath-29          [-1, 56, 56, 128]               0
        LayerNorm-30            [-1, 3136, 128]             256
           Linear-31            [-1, 3136, 512]          66,048
             GELU-32            [-1, 3136, 512]               0
          Dropout-33            [-1, 3136, 512]               0
           Linear-34            [-1, 3136, 128]          65,664
          Dropout-35            [-1, 3136, 128]               0
              Mlp-36            [-1, 3136, 128]               0
         DropPath-37            [-1, 3136, 128]               0
SwinTransformerBlock-38          [-1, 56, 56, 128]               0
SwinTransformerStage-39          [-1, 56, 56, 128]               0
        LayerNorm-40          [-1, 28, 28, 512]           1,024
           Linear-41          [-1, 28, 28, 256]         131,072
     PatchMerging-42          [-1, 28, 28, 256]               0
        LayerNorm-43          [-1, 28, 28, 256]             512
           Linear-44              [-1, 49, 768]         197,376
          Softmax-45            [-1, 8, 49, 49]               0
          Dropout-46            [-1, 8, 49, 49]               0
           Linear-47              [-1, 49, 256]          65,792
          Dropout-48              [-1, 49, 256]               0
  WindowAttention-49              [-1, 49, 256]               0
         DropPath-50          [-1, 28, 28, 256]               0
        LayerNorm-51             [-1, 784, 256]             512
           Linear-52            [-1, 784, 1024]         263,168
             GELU-53            [-1, 784, 1024]               0
          Dropout-54            [-1, 784, 1024]               0
           Linear-55             [-1, 784, 256]         262,400
          Dropout-56             [-1, 784, 256]               0
              Mlp-57             [-1, 784, 256]               0
         DropPath-58             [-1, 784, 256]               0
SwinTransformerBlock-59          [-1, 28, 28, 256]               0
        LayerNorm-60          [-1, 28, 28, 256]             512
           Linear-61              [-1, 49, 768]         197,376
          Softmax-62            [-1, 8, 49, 49]               0
          Dropout-63            [-1, 8, 49, 49]               0
           Linear-64              [-1, 49, 256]          65,792
          Dropout-65              [-1, 49, 256]               0
  WindowAttention-66              [-1, 49, 256]               0
         DropPath-67          [-1, 28, 28, 256]               0
        LayerNorm-68             [-1, 784, 256]             512
           Linear-69            [-1, 784, 1024]         263,168
             GELU-70            [-1, 784, 1024]               0
          Dropout-71            [-1, 784, 1024]               0
           Linear-72             [-1, 784, 256]         262,400
          Dropout-73             [-1, 784, 256]               0
              Mlp-74             [-1, 784, 256]               0
         DropPath-75             [-1, 784, 256]               0
SwinTransformerBlock-76          [-1, 28, 28, 256]               0
SwinTransformerStage-77          [-1, 28, 28, 256]               0
        LayerNorm-78         [-1, 14, 14, 1024]           2,048
           Linear-79          [-1, 14, 14, 512]         524,288
     PatchMerging-80          [-1, 14, 14, 512]               0
        LayerNorm-81          [-1, 14, 14, 512]           1,024
           Linear-82             [-1, 49, 1536]         787,968
          Softmax-83           [-1, 16, 49, 49]               0
          Dropout-84           [-1, 16, 49, 49]               0
           Linear-85              [-1, 49, 512]         262,656
          Dropout-86              [-1, 49, 512]               0
  WindowAttention-87              [-1, 49, 512]               0
         DropPath-88          [-1, 14, 14, 512]               0
        LayerNorm-89             [-1, 196, 512]           1,024
           Linear-90            [-1, 196, 2048]       1,050,624
             GELU-91            [-1, 196, 2048]               0
          Dropout-92            [-1, 196, 2048]               0
           Linear-93             [-1, 196, 512]       1,049,088
          Dropout-94             [-1, 196, 512]               0
              Mlp-95             [-1, 196, 512]               0
         DropPath-96             [-1, 196, 512]               0
SwinTransformerBlock-97          [-1, 14, 14, 512]               0
        LayerNorm-98          [-1, 14, 14, 512]           1,024
           Linear-99             [-1, 49, 1536]         787,968
         Softmax-100           [-1, 16, 49, 49]               0
         Dropout-101           [-1, 16, 49, 49]               0
          Linear-102              [-1, 49, 512]         262,656
         Dropout-103              [-1, 49, 512]               0
 WindowAttention-104              [-1, 49, 512]               0
        DropPath-105          [-1, 14, 14, 512]               0
       LayerNorm-106             [-1, 196, 512]           1,024
          Linear-107            [-1, 196, 2048]       1,050,624
            GELU-108            [-1, 196, 2048]               0
         Dropout-109            [-1, 196, 2048]               0
          Linear-110             [-1, 196, 512]       1,049,088
         Dropout-111             [-1, 196, 512]               0
             Mlp-112             [-1, 196, 512]               0
        DropPath-113             [-1, 196, 512]               0
SwinTransformerBlock-114          [-1, 14, 14, 512]               0
       LayerNorm-115          [-1, 14, 14, 512]           1,024
          Linear-116             [-1, 49, 1536]         787,968
         Softmax-117           [-1, 16, 49, 49]               0
         Dropout-118           [-1, 16, 49, 49]               0
          Linear-119              [-1, 49, 512]         262,656
         Dropout-120              [-1, 49, 512]               0
 WindowAttention-121              [-1, 49, 512]               0
        DropPath-122          [-1, 14, 14, 512]               0
       LayerNorm-123             [-1, 196, 512]           1,024
          Linear-124            [-1, 196, 2048]       1,050,624
            GELU-125            [-1, 196, 2048]               0
         Dropout-126            [-1, 196, 2048]               0
          Linear-127             [-1, 196, 512]       1,049,088
         Dropout-128             [-1, 196, 512]               0
             Mlp-129             [-1, 196, 512]               0
        DropPath-130             [-1, 196, 512]               0
SwinTransformerBlock-131          [-1, 14, 14, 512]               0
       LayerNorm-132          [-1, 14, 14, 512]           1,024
          Linear-133             [-1, 49, 1536]         787,968
         Softmax-134           [-1, 16, 49, 49]               0
         Dropout-135           [-1, 16, 49, 49]               0
          Linear-136              [-1, 49, 512]         262,656
         Dropout-137              [-1, 49, 512]               0
 WindowAttention-138              [-1, 49, 512]               0
        DropPath-139          [-1, 14, 14, 512]               0
       LayerNorm-140             [-1, 196, 512]           1,024
          Linear-141            [-1, 196, 2048]       1,050,624
            GELU-142            [-1, 196, 2048]               0
         Dropout-143            [-1, 196, 2048]               0
          Linear-144             [-1, 196, 512]       1,049,088
         Dropout-145             [-1, 196, 512]               0
             Mlp-146             [-1, 196, 512]               0
        DropPath-147             [-1, 196, 512]               0
SwinTransformerBlock-148          [-1, 14, 14, 512]               0
       LayerNorm-149          [-1, 14, 14, 512]           1,024
          Linear-150             [-1, 49, 1536]         787,968
         Softmax-151           [-1, 16, 49, 49]               0
         Dropout-152           [-1, 16, 49, 49]               0
          Linear-153              [-1, 49, 512]         262,656
         Dropout-154              [-1, 49, 512]               0
 WindowAttention-155              [-1, 49, 512]               0
        DropPath-156          [-1, 14, 14, 512]               0
       LayerNorm-157             [-1, 196, 512]           1,024
          Linear-158            [-1, 196, 2048]       1,050,624
            GELU-159            [-1, 196, 2048]               0
         Dropout-160            [-1, 196, 2048]               0
          Linear-161             [-1, 196, 512]       1,049,088
         Dropout-162             [-1, 196, 512]               0
             Mlp-163             [-1, 196, 512]               0
        DropPath-164             [-1, 196, 512]               0
SwinTransformerBlock-165          [-1, 14, 14, 512]               0
       LayerNorm-166          [-1, 14, 14, 512]           1,024
          Linear-167             [-1, 49, 1536]         787,968
         Softmax-168           [-1, 16, 49, 49]               0
         Dropout-169           [-1, 16, 49, 49]               0
          Linear-170              [-1, 49, 512]         262,656
         Dropout-171              [-1, 49, 512]               0
 WindowAttention-172              [-1, 49, 512]               0
        DropPath-173          [-1, 14, 14, 512]               0
       LayerNorm-174             [-1, 196, 512]           1,024
          Linear-175            [-1, 196, 2048]       1,050,624
            GELU-176            [-1, 196, 2048]               0
         Dropout-177            [-1, 196, 2048]               0
          Linear-178             [-1, 196, 512]       1,049,088
         Dropout-179             [-1, 196, 512]               0
             Mlp-180             [-1, 196, 512]               0
        DropPath-181             [-1, 196, 512]               0
SwinTransformerBlock-182          [-1, 14, 14, 512]               0
       LayerNorm-183          [-1, 14, 14, 512]           1,024
          Linear-184             [-1, 49, 1536]         787,968
         Softmax-185           [-1, 16, 49, 49]               0
         Dropout-186           [-1, 16, 49, 49]               0
          Linear-187              [-1, 49, 512]         262,656
         Dropout-188              [-1, 49, 512]               0
 WindowAttention-189              [-1, 49, 512]               0
        DropPath-190          [-1, 14, 14, 512]               0
       LayerNorm-191             [-1, 196, 512]           1,024
          Linear-192            [-1, 196, 2048]       1,050,624
            GELU-193            [-1, 196, 2048]               0
         Dropout-194            [-1, 196, 2048]               0
          Linear-195             [-1, 196, 512]       1,049,088
         Dropout-196             [-1, 196, 512]               0
             Mlp-197             [-1, 196, 512]               0
        DropPath-198             [-1, 196, 512]               0
SwinTransformerBlock-199          [-1, 14, 14, 512]               0
       LayerNorm-200          [-1, 14, 14, 512]           1,024
          Linear-201             [-1, 49, 1536]         787,968
         Softmax-202           [-1, 16, 49, 49]               0
         Dropout-203           [-1, 16, 49, 49]               0
          Linear-204              [-1, 49, 512]         262,656
         Dropout-205              [-1, 49, 512]               0
 WindowAttention-206              [-1, 49, 512]               0
        DropPath-207          [-1, 14, 14, 512]               0
       LayerNorm-208             [-1, 196, 512]           1,024
          Linear-209            [-1, 196, 2048]       1,050,624
            GELU-210            [-1, 196, 2048]               0
         Dropout-211            [-1, 196, 2048]               0
          Linear-212             [-1, 196, 512]       1,049,088
         Dropout-213             [-1, 196, 512]               0
             Mlp-214             [-1, 196, 512]               0
        DropPath-215             [-1, 196, 512]               0
SwinTransformerBlock-216          [-1, 14, 14, 512]               0
       LayerNorm-217          [-1, 14, 14, 512]           1,024
          Linear-218             [-1, 49, 1536]         787,968
         Softmax-219           [-1, 16, 49, 49]               0
         Dropout-220           [-1, 16, 49, 49]               0
          Linear-221              [-1, 49, 512]         262,656
         Dropout-222              [-1, 49, 512]               0
 WindowAttention-223              [-1, 49, 512]               0
        DropPath-224          [-1, 14, 14, 512]               0
       LayerNorm-225             [-1, 196, 512]           1,024
          Linear-226            [-1, 196, 2048]       1,050,624
            GELU-227            [-1, 196, 2048]               0
         Dropout-228            [-1, 196, 2048]               0
          Linear-229             [-1, 196, 512]       1,049,088
         Dropout-230             [-1, 196, 512]               0
             Mlp-231             [-1, 196, 512]               0
        DropPath-232             [-1, 196, 512]               0
SwinTransformerBlock-233          [-1, 14, 14, 512]               0
       LayerNorm-234          [-1, 14, 14, 512]           1,024
          Linear-235             [-1, 49, 1536]         787,968
         Softmax-236           [-1, 16, 49, 49]               0
         Dropout-237           [-1, 16, 49, 49]               0
          Linear-238              [-1, 49, 512]         262,656
         Dropout-239              [-1, 49, 512]               0
 WindowAttention-240              [-1, 49, 512]               0
        DropPath-241          [-1, 14, 14, 512]               0
       LayerNorm-242             [-1, 196, 512]           1,024
          Linear-243            [-1, 196, 2048]       1,050,624
            GELU-244            [-1, 196, 2048]               0
         Dropout-245            [-1, 196, 2048]               0
          Linear-246             [-1, 196, 512]       1,049,088
         Dropout-247             [-1, 196, 512]               0
             Mlp-248             [-1, 196, 512]               0
        DropPath-249             [-1, 196, 512]               0
SwinTransformerBlock-250          [-1, 14, 14, 512]               0
       LayerNorm-251          [-1, 14, 14, 512]           1,024
          Linear-252             [-1, 49, 1536]         787,968
         Softmax-253           [-1, 16, 49, 49]               0
         Dropout-254           [-1, 16, 49, 49]               0
          Linear-255              [-1, 49, 512]         262,656
         Dropout-256              [-1, 49, 512]               0
 WindowAttention-257              [-1, 49, 512]               0
        DropPath-258          [-1, 14, 14, 512]               0
       LayerNorm-259             [-1, 196, 512]           1,024
          Linear-260            [-1, 196, 2048]       1,050,624
            GELU-261            [-1, 196, 2048]               0
         Dropout-262            [-1, 196, 2048]               0
          Linear-263             [-1, 196, 512]       1,049,088
         Dropout-264             [-1, 196, 512]               0
             Mlp-265             [-1, 196, 512]               0
        DropPath-266             [-1, 196, 512]               0
SwinTransformerBlock-267          [-1, 14, 14, 512]               0
       LayerNorm-268          [-1, 14, 14, 512]           1,024
          Linear-269             [-1, 49, 1536]         787,968
         Softmax-270           [-1, 16, 49, 49]               0
         Dropout-271           [-1, 16, 49, 49]               0
          Linear-272              [-1, 49, 512]         262,656
         Dropout-273              [-1, 49, 512]               0
 WindowAttention-274              [-1, 49, 512]               0
        DropPath-275          [-1, 14, 14, 512]               0
       LayerNorm-276             [-1, 196, 512]           1,024
          Linear-277            [-1, 196, 2048]       1,050,624
            GELU-278            [-1, 196, 2048]               0
         Dropout-279            [-1, 196, 2048]               0
          Linear-280             [-1, 196, 512]       1,049,088
         Dropout-281             [-1, 196, 512]               0
             Mlp-282             [-1, 196, 512]               0
        DropPath-283             [-1, 196, 512]               0
SwinTransformerBlock-284          [-1, 14, 14, 512]               0
       LayerNorm-285          [-1, 14, 14, 512]           1,024
          Linear-286             [-1, 49, 1536]         787,968
         Softmax-287           [-1, 16, 49, 49]               0
         Dropout-288           [-1, 16, 49, 49]               0
          Linear-289              [-1, 49, 512]         262,656
         Dropout-290              [-1, 49, 512]               0
 WindowAttention-291              [-1, 49, 512]               0
        DropPath-292          [-1, 14, 14, 512]               0
       LayerNorm-293             [-1, 196, 512]           1,024
          Linear-294            [-1, 196, 2048]       1,050,624
            GELU-295            [-1, 196, 2048]               0
         Dropout-296            [-1, 196, 2048]               0
          Linear-297             [-1, 196, 512]       1,049,088
         Dropout-298             [-1, 196, 512]               0
             Mlp-299             [-1, 196, 512]               0
        DropPath-300             [-1, 196, 512]               0
SwinTransformerBlock-301          [-1, 14, 14, 512]               0
       LayerNorm-302          [-1, 14, 14, 512]           1,024
          Linear-303             [-1, 49, 1536]         787,968
         Softmax-304           [-1, 16, 49, 49]               0
         Dropout-305           [-1, 16, 49, 49]               0
          Linear-306              [-1, 49, 512]         262,656
         Dropout-307              [-1, 49, 512]               0
 WindowAttention-308              [-1, 49, 512]               0
        DropPath-309          [-1, 14, 14, 512]               0
       LayerNorm-310             [-1, 196, 512]           1,024
          Linear-311            [-1, 196, 2048]       1,050,624
            GELU-312            [-1, 196, 2048]               0
         Dropout-313            [-1, 196, 2048]               0
          Linear-314             [-1, 196, 512]       1,049,088
         Dropout-315             [-1, 196, 512]               0
             Mlp-316             [-1, 196, 512]               0
        DropPath-317             [-1, 196, 512]               0
SwinTransformerBlock-318          [-1, 14, 14, 512]               0
       LayerNorm-319          [-1, 14, 14, 512]           1,024
          Linear-320             [-1, 49, 1536]         787,968
         Softmax-321           [-1, 16, 49, 49]               0
         Dropout-322           [-1, 16, 49, 49]               0
          Linear-323              [-1, 49, 512]         262,656
         Dropout-324              [-1, 49, 512]               0
 WindowAttention-325              [-1, 49, 512]               0
        DropPath-326          [-1, 14, 14, 512]               0
       LayerNorm-327             [-1, 196, 512]           1,024
          Linear-328            [-1, 196, 2048]       1,050,624
            GELU-329            [-1, 196, 2048]               0
         Dropout-330            [-1, 196, 2048]               0
          Linear-331             [-1, 196, 512]       1,049,088
         Dropout-332             [-1, 196, 512]               0
             Mlp-333             [-1, 196, 512]               0
        DropPath-334             [-1, 196, 512]               0
SwinTransformerBlock-335          [-1, 14, 14, 512]               0
       LayerNorm-336          [-1, 14, 14, 512]           1,024
          Linear-337             [-1, 49, 1536]         787,968
         Softmax-338           [-1, 16, 49, 49]               0
         Dropout-339           [-1, 16, 49, 49]               0
          Linear-340              [-1, 49, 512]         262,656
         Dropout-341              [-1, 49, 512]               0
 WindowAttention-342              [-1, 49, 512]               0
        DropPath-343          [-1, 14, 14, 512]               0
       LayerNorm-344             [-1, 196, 512]           1,024
          Linear-345            [-1, 196, 2048]       1,050,624
            GELU-346            [-1, 196, 2048]               0
         Dropout-347            [-1, 196, 2048]               0
          Linear-348             [-1, 196, 512]       1,049,088
         Dropout-349             [-1, 196, 512]               0
             Mlp-350             [-1, 196, 512]               0
        DropPath-351             [-1, 196, 512]               0
SwinTransformerBlock-352          [-1, 14, 14, 512]               0
       LayerNorm-353          [-1, 14, 14, 512]           1,024
          Linear-354             [-1, 49, 1536]         787,968
         Softmax-355           [-1, 16, 49, 49]               0
         Dropout-356           [-1, 16, 49, 49]               0
          Linear-357              [-1, 49, 512]         262,656
         Dropout-358              [-1, 49, 512]               0
 WindowAttention-359              [-1, 49, 512]               0
        DropPath-360          [-1, 14, 14, 512]               0
       LayerNorm-361             [-1, 196, 512]           1,024
          Linear-362            [-1, 196, 2048]       1,050,624
            GELU-363            [-1, 196, 2048]               0
         Dropout-364            [-1, 196, 2048]               0
          Linear-365             [-1, 196, 512]       1,049,088
         Dropout-366             [-1, 196, 512]               0
             Mlp-367             [-1, 196, 512]               0
        DropPath-368             [-1, 196, 512]               0
SwinTransformerBlock-369          [-1, 14, 14, 512]               0
       LayerNorm-370          [-1, 14, 14, 512]           1,024
          Linear-371             [-1, 49, 1536]         787,968
         Softmax-372           [-1, 16, 49, 49]               0
         Dropout-373           [-1, 16, 49, 49]               0
          Linear-374              [-1, 49, 512]         262,656
         Dropout-375              [-1, 49, 512]               0
 WindowAttention-376              [-1, 49, 512]               0
        DropPath-377          [-1, 14, 14, 512]               0
       LayerNorm-378             [-1, 196, 512]           1,024
          Linear-379            [-1, 196, 2048]       1,050,624
            GELU-380            [-1, 196, 2048]               0
         Dropout-381            [-1, 196, 2048]               0
          Linear-382             [-1, 196, 512]       1,049,088
         Dropout-383             [-1, 196, 512]               0
             Mlp-384             [-1, 196, 512]               0
        DropPath-385             [-1, 196, 512]               0
SwinTransformerBlock-386          [-1, 14, 14, 512]               0
SwinTransformerStage-387          [-1, 14, 14, 512]               0
       LayerNorm-388           [-1, 7, 7, 2048]           4,096
          Linear-389           [-1, 7, 7, 1024]       2,097,152
    PatchMerging-390           [-1, 7, 7, 1024]               0
       LayerNorm-391           [-1, 7, 7, 1024]           2,048
          Linear-392             [-1, 49, 3072]       3,148,800
         Softmax-393           [-1, 32, 49, 49]               0
         Dropout-394           [-1, 32, 49, 49]               0
          Linear-395             [-1, 49, 1024]       1,049,600
         Dropout-396             [-1, 49, 1024]               0
 WindowAttention-397             [-1, 49, 1024]               0
        DropPath-398           [-1, 7, 7, 1024]               0
       LayerNorm-399             [-1, 49, 1024]           2,048
          Linear-400             [-1, 49, 4096]       4,198,400
            GELU-401             [-1, 49, 4096]               0
         Dropout-402             [-1, 49, 4096]               0
          Linear-403             [-1, 49, 1024]       4,195,328
         Dropout-404             [-1, 49, 1024]               0
             Mlp-405             [-1, 49, 1024]               0
        DropPath-406             [-1, 49, 1024]               0
SwinTransformerBlock-407           [-1, 7, 7, 1024]               0
       LayerNorm-408           [-1, 7, 7, 1024]           2,048
          Linear-409             [-1, 49, 3072]       3,148,800
         Softmax-410           [-1, 32, 49, 49]               0
         Dropout-411           [-1, 32, 49, 49]               0
          Linear-412             [-1, 49, 1024]       1,049,600
         Dropout-413             [-1, 49, 1024]               0
 WindowAttention-414             [-1, 49, 1024]               0
        DropPath-415           [-1, 7, 7, 1024]               0
       LayerNorm-416             [-1, 49, 1024]           2,048
          Linear-417             [-1, 49, 4096]       4,198,400
            GELU-418             [-1, 49, 4096]               0
         Dropout-419             [-1, 49, 4096]               0
          Linear-420             [-1, 49, 1024]       4,195,328
         Dropout-421             [-1, 49, 1024]               0
             Mlp-422             [-1, 49, 1024]               0
        DropPath-423             [-1, 49, 1024]               0
SwinTransformerBlock-424           [-1, 7, 7, 1024]               0
SwinTransformerStage-425           [-1, 7, 7, 1024]               0
       LayerNorm-426           [-1, 7, 7, 1024]           2,048
FastAdaptiveAvgPool-427                 [-1, 1024]               0
        Identity-428                 [-1, 1024]               0
SelectAdaptivePool2d-429                 [-1, 1024]               0
         Dropout-430                 [-1, 1024]               0
          Linear-431                 [-1, 1000]       1,025,000
        Identity-432                 [-1, 1000]               0
  ClassifierHead-433                 [-1, 1000]               0
================================================================
Total params: 87,704,680
Trainable params: 87,704,680
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 544.60
Params size (MB): 334.57
Estimated Total Size (MB): 879.74
----------------------------------------------------------------
